starlingcode/via_archive/Documents/stm32 workspace/onetouchkey/Src/main.c
void SetFlags(void){
	if (uhTSCAcquisitionValue3 < 2320) {
	    	not2 = 1;
	    	not1 = 1;}
	    else {
	    	not2 = 0;
	        not1 = 0;};
	    if (uhTSCAcquisitionValue1 < 1845) {
	        	not3 = 1;
	        	not2 = 1;}
	        else {
	        	not3 = 0;
	            not2 = 0;};
	    if (uhTSCAcquisitionValue2 < 2300) {
	           	not3 = 1;
	           	not1 = 1;}
	           else {
	           	not3 = 0;
	            not1 = 0;};
	    if (not1 == 0 && not2 == 1 && not3 == 0) {flag1 = 1;
	    		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);}
	    else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_RESET);
	    		flag1 = 0;}
	    if (not1 == 1 && not2 == 0 && not3 == 1) {flag2 = 1;
	        		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);}
	        else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET);
	        			flag2 = 0;}
	    if (not1 == 1 && not2 == 1 && not3 == 1) {flag3 = 1;
	            		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);}
	            else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_RESET);
	            		flag3 = 0;}
}

void ReadPins(uint8_t pin){
	if (pin == 0) {
	    if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_10) == GPIO_PIN_RESET) {
	    	flag1 = 1;
	    	ShowMode(speed);}
	    else {
	    		flag1 = 0;}
	}
	if (pin == 1) {
	    if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_11) == GPIO_PIN_RESET) {
	    	flag2 = 1;
	    	ShowMode(trigmode);}
	        else {
	        			flag2 = 0;}
	}
	if (pin == 2) {
	    if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_12) == GPIO_PIN_RESET) {
	    	flag3 = 1;
	    	ShowMode(loop);}
	            else {flag3 = 0;}
	}
	if (pin == 3) {
	    if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_9) == GPIO_PIN_RESET) {
	    	flag4 = 1;
	    	ShowMode(samphold);}
	            else {flag4 = 0;}
	}
}

void ChangeMode(void) {
		if (flag1 > temp1) {
			speed = (speed + 1) % 2;
		}
		if (flag2 > temp2) {
			trigmode = (trigmode + 1) % 5;
		}
		if (flag3 > temp3) {
			loop = (loop + 1) % 2;
		}
		if (flag4 > temp4) {
			samphold = (samphold + 1) % 6;
		}
		temp1 = flag1;
		temp2 = flag2;
		temp3 = flag3;
		temp4 = flag4;
}

void ShowMode(uint8_t currentmode) {
	if (currentmode == 1) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);
	}
	if (currentmode == 2) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);
	}
	if (currentmode == 3) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);

	}
	if (currentmode == 4) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);

	}
	if (currentmode == 5) {
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);

	}
}

void ClearDisplay(void) {
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET);
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
